# pandasTutorial

In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

## Series

In [14]:
obj=Series([1,2,3,4])

#indexing is on the left, while value on the right
print(obj)

print(type(obj.index))

#Series.value == np.array they are the same class
print(type(obj.values),type(np.array([[1,2],[3,4]])))

#specific indexing
obj2=Series([6,4,8],index=['a','b','c'])
print(obj2)

0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.indexes.range.RangeIndex'>
<class 'numpy.ndarray'> <class 'numpy.ndarray'>
a    6
b    4
c    8
dtype: int64

In [19]:
#Series can perform NumPy Array math
print(obj2[obj2%3==0])
print(obj2*2)

a    6
dtype: int64
a    12
b     8
c    16
dtype: int64

In [30]:
#Series can also be treat as dict
print('b' in obj2)
print('e' in obj2)
#参数可以是dict
obj3=Series({'jack':1,'anna':0})
print(obj3)

#参数可以是dict，另外再有index，Series（dict，index）
#以index为准

#检测是否为空 pd.isnull,pd.Notnull

#Series 可以根据索引自动对齐

#name属性
obj3.name="family"
obj3.index.name="member"
print(obj3)

True
False
anna    0
jack    1
dtype: int64
member
anna    0
jack    1
Name: family, dtype: int64

## DataFrame

In [44]:
titanic = pd.read_csv("train.csv")
print(type(titanic))
print(titanic)

<class 'pandas.core.frame.DataFrame'>
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
12                      Saundercock, Mr. William Henry    male  20.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                                Rice, Master. Eugene    male   2.0      4
17                        Williams, Mr. Charles Eugene    male   NaN      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
20                                Fynney, Mr. Joseph J    male  35.0      0
21                               Beesley, Mr. Lawrence    male  34.0      0
22                         McGowan, Miss. Anna "Annie"  female  15.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
24                       Palsson, Miss. Torborg Danira  female   8.0      3
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
26                             Emir, Mr. Farred Chehab    male   NaN      0
27                      Fortune, Mr. Charles Alexander    male  19.0      3
28                       O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
29                                 Todoroff, Mr. Lalio    male   NaN      0
..                                                 ...     ...   ...    ...
861                        Giles, Mr. Frederick Edward    male  21.0      1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
864                             Gill, Mr. John William    male  24.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
867               Roebling, Mr. Washington Augustus II    male  31.0      0
868                        van Melkebeke, Mr. Philemon    male   NaN      0
869                    Johnson, Master. Harold Theodor    male   4.0      1
870                                  Balkic, Mr. Cerin    male  26.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
876                      Gustafsson, Mr. Alfred Ossian    male  20.0      0
877                               Petroff, Mr. Nedelio    male  19.0      0
878                                 Laleff, Mr. Kristo    male   NaN      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket      Fare        Cabin Embarked
0        0         A/5 21171    7.2500          NaN        S
1        0          PC 17599   71.2833          C85        C
2        0  STON/O2. 3101282    7.9250          NaN        S
3        0            113803   53.1000         C123        S
4        0            373450    8.0500          NaN        S
5        0            330877    8.4583          NaN        Q
6        0             17463   51.8625          E46        S
7        1            349909   21.0750          NaN        S
8        2            347742   11.1333          NaN        S
9        0            237736   30.0708          NaN        C
10       1           PP 9549   16.7000           G6        S
11       0            113783   26.5500         C103        S
12       0         A/5. 2151    8.0500          NaN        S
13       5            347082   31.2750          NaN        S
14       0            350406    7.8542          NaN        S
15       0            248706   16.0000          NaN        S
16       1            382652   29.1250          NaN        Q
17       0            244373   13.0000          NaN        S
18       0            345763   18.0000          NaN        S
19       0              2649    7.2250          NaN        C
20       0            239865   26.0000          NaN        S
21       0            248698   13.0000          D56        S
22       0            330923    8.0292          NaN        Q
23       0            113788   35.5000           A6        S
24       1            349909   21.0750          NaN        S
25       5            347077   31.3875          NaN        S
26       0              2631    7.2250          NaN        C
27       2             19950  263.0000  C23 C25 C27        S
28       0            330959    7.8792          NaN        Q
29       0            349216    7.8958          NaN        S
..     ...               ...       ...          ...      ...
861      0             28134   11.5000          NaN        S
862      0             17466   25.9292          D17        S
863      2          CA. 2343   69.5500          NaN        S
864      0            233866   13.0000          NaN        S
865      0            236852   13.0000          NaN        S
866      0     SC/PARIS 2149   13.8583          NaN        C
867      0          PC 17590   50.4958          A24        S
868      0            345777    9.5000          NaN        S
869      1            347742   11.1333          NaN        S
870      0            349248    7.8958          NaN        S
871      1             11751   52.5542          D35        S
872      0               695    5.0000  B51 B53 B55        S
873      0            345765    9.0000          NaN        S
874      0         P/PP 3381   24.0000          NaN        C
875      0              2667    7.2250          NaN        C
876      0              7534    9.8458          NaN        S
877      0            349212    7.8958          NaN        S
878      0            349217    7.8958          NaN        S
879      1             11767   83.1583          C50        C
880      1            230433   26.0000          NaN        S
881      0            349257    7.8958          NaN        S
882      0              7552   10.5167          NaN        S
883      0  C.A./SOTON 34068   10.5000          NaN        S
884      0   SOTON/OQ 392076    7.0500          NaN        S
885      5            382652   29.1250          NaN        Q
886      0            211536   13.0000          NaN        S
887      0            112053   30.0000          B42        S
888      2        W./C. 6607   23.4500          NaN        S
889      0            111369   30.0000         C148        C
890      0            370376    7.7500          NaN        Q

[891 rows x 12 columns]

In [53]:
#dataframe 取列值得series,其索引为原dataframe索引
print(type(titanic.Age))

#可以为dataframe加上series
titanic['show']=Series(np.arange(len(titanic)))
print(titanic.show)
del titanic['show']

<class 'pandas.core.series.Series'>
0        0
1        1
2        2
3        3
4        4
5        5
6        6
7        7
8        8
9        9
10      10
11      11
12      12
13      13
14      14
15      15
16      16
17      17
18      18
19      19
20      20
21      21
22      22
23      23
24      24
25      25
26      26
27      27
28      28
29      29
      ...
861    861
862    862
863    863
864    864
865    865
866    866
867    867
868    868
869    869
870    870
871    871
872    872
873    873
874    874
875    875
876    876
877    877
878    878
879    879
880    880
881    881
882    882
883    883
884    884
885    885
886    886
887    887
888    888
889    889
890    890
Name: show, dtype: int32

In [54]:
#嵌套字典 外层key作为列值，内层key作为索引，内层不是字典而是Series一样
#dataframe.values 返回二维ndarray
titanic.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [55]:
#关于index，作为对象，不可直接改变，index类方法见python data analysis p126

## 10 Minutes to pandas 
http://pandas.pydata.org/pandas-docs/stable/10min.html#min

## df creating

In [3]:
dates = pd.date_range('20130101', periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.294356 -0.894005 -0.294631  0.366168
2013-01-02 -0.714688 -0.236710  0.007486  2.563781
2013-01-03 -1.702227  0.705403  1.484354 -0.621361
2013-01-04 -2.440249  1.172988  1.010370  0.367108
2013-01-05  0.057939 -0.437060  0.136405  0.483244
2013-01-06  1.333499  0.762575 -1.158400 -0.103778

In [79]:
#use tab after input '.' for completion 
df.A

2013-01-01   -0.674154
2013-01-02   -0.889458
2013-01-03   -0.642209
2013-01-04   -0.188418
2013-01-05   -1.706170
2013-01-06   -0.007147
Freq: D, Name: A, dtype: float64

## viewing data

In [80]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.188418  1.186738 -1.052341  0.423237
2013-01-05 -1.706170  0.660301  2.449283  1.001341
2013-01-06 -0.007147  1.114072 -0.023579  1.435661

In [81]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.684593  0.911804  0.567937  0.414664
std    0.598768  0.416574  1.314541  0.888046
min   -1.706170  0.381443 -1.052341 -0.783923
25%   -0.835632  0.644880 -0.382379 -0.278720
50%   -0.658181  0.887186  0.617266  0.673805
75%   -0.301865  1.168572  1.273123  0.982099
max   -0.007147  1.488528  2.449283  1.435661

In [82]:
#transposing
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.674154   -0.889458   -0.642209   -0.188418   -1.706170   -0.007147
B    1.488528    0.381443    0.639740    1.186738    0.660301    1.114072
C    1.258111    1.278126   -0.501979   -1.052341    2.449283   -0.023579
D   -0.783923    0.924373   -0.512706    0.423237    1.001341    1.435661

In [83]:
#sort by column at descending
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.783923  1.258111  1.488528 -0.674154
2013-01-02  0.924373  1.278126  0.381443 -0.889458
2013-01-03 -0.512706 -0.501979  0.639740 -0.642209
2013-01-04  0.423237 -1.052341  1.186738 -0.188418
2013-01-05  1.001341  2.449283  0.660301 -1.706170
2013-01-06  1.435661 -0.023579  1.114072 -0.007147

In [84]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.889458  0.381443  1.278126  0.924373
2013-01-03 -0.642209  0.639740 -0.501979 -0.512706
2013-01-05 -1.706170  0.660301  2.449283  1.001341
2013-01-06 -0.007147  1.114072 -0.023579  1.435661
2013-01-04 -0.188418  1.186738 -1.052341  0.423237
2013-01-01 -0.674154  1.488528  1.258111 -0.783923

In [5]:
#numbers of columns and rows
df.shape

(6, 4)

## selection

In [85]:
#integer indexing or slice,the same as numpy,but it only works with 1 dimension

### Selection by Label

In [87]:
#location more specific with 2 dimension
print(df.loc[:,['A','C']])

                   A         C
2013-01-01 -0.674154  1.258111
2013-01-02 -0.889458  1.278126
2013-01-03 -0.642209 -0.501979
2013-01-04 -0.188418 -1.052341
2013-01-05 -1.706170  2.449283
2013-01-06 -0.007147 -0.023579

### Selection by Position

In [91]:
#row 3
df.iloc[3]

A   -0.188418
B    1.186738
C   -1.052341
D    0.423237
Name: 2013-01-04 00:00:00, dtype: float64

In [92]:
#row 3:5 col 0:2
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.188418  1.186738
2013-01-05 -1.706170  0.660301

In [93]:
#list combination ,row & col number here
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.889458  1.278126
2013-01-03 -0.642209 -0.501979
2013-01-05 -1.706170  2.449283

### Boolean Indexing

In [98]:
df[df.C > 0]

                   A         B         C         D
2013-01-01 -0.674154  1.488528  1.258111 -0.783923
2013-01-02 -0.889458  0.381443  1.278126  0.924373
2013-01-05 -1.706170  0.660301  2.449283  1.001341

In [99]:
df[df > 0]

             A         B         C         D
2013-01-01 NaN  1.488528  1.258111       NaN
2013-01-02 NaN  0.381443  1.278126  0.924373
2013-01-03 NaN  0.639740       NaN       NaN
2013-01-04 NaN  1.186738       NaN  0.423237
2013-01-05 NaN  0.660301  2.449283  1.001341
2013-01-06 NaN  1.114072       NaN  1.435661

In [103]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2[df2['E'].isin(['two','four'])]#index is Series hera

                   A         B         C         D     E
2013-01-03 -0.642209  0.639740 -0.501979 -0.512706   two
2013-01-05 -1.706170  0.660301  2.449283  1.001341  four

### Setting
Setting a new column automatically aligns the data by the indexes

Setting values by label

Setting values by position

Setting by assigning with a numpy array

In [108]:
# make every elem smaller than 0
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C         D
2013-01-01 -0.674154 -1.488528 -1.258111 -0.783923
2013-01-02 -0.889458 -0.381443 -1.278126 -0.924373
2013-01-03 -0.642209 -0.639740 -0.501979 -0.512706
2013-01-04 -0.188418 -1.186738 -1.052341 -0.423237
2013-01-05 -1.706170 -0.660301 -2.449283 -1.001341
2013-01-06 -0.007147 -1.114072 -0.023579 -1.435661

## Missing Data

In [111]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2013-01-01 -0.674154  1.488528  1.258111 -0.783923  1.0
2013-01-02 -0.889458  0.381443  1.278126  0.924373  NaN
2013-01-03 -0.642209  0.639740 -0.501979 -0.512706  NaN
2013-01-04 -0.188418  1.186738 -1.052341  0.423237  NaN

In [112]:
#To drop any rows that have missing data.
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01 -0.674154  1.488528  1.258111 -0.783923  1.0

In [113]:
#Filling missing data
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -0.674154  1.488528  1.258111 -0.783923  1.0
2013-01-02 -0.889458  0.381443  1.278126  0.924373  5.0
2013-01-03 -0.642209  0.639740 -0.501979 -0.512706  5.0
2013-01-04 -0.188418  1.186738 -1.052341  0.423237  5.0

## Operations

### stats

In [117]:
print(df.mean(0))
print(df.mean(1))

A   -0.684593
B    0.911804
C    0.567937
D    0.414664
dtype: float64
2013-01-01    0.322141
2013-01-02    0.423621
2013-01-03   -0.254288
2013-01-04    0.092304
2013-01-05    0.601189
2013-01-06    0.629752
Freq: D, dtype: float64

In [127]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
#automatically broadcasting
df.sub(s, axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -1.642209 -0.360260 -1.501979 -1.512706
2013-01-04 -3.188418 -1.813262 -4.052341 -2.576763
2013-01-05 -6.706170 -4.339699 -2.550717 -3.998659
2013-01-06       NaN       NaN       NaN       NaN

### Apply

In [128]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.674154  1.488528  1.258111 -0.783923
2013-01-02 -1.563612  1.869971  2.536238  0.140450
2013-01-03 -2.205821  2.509711  2.034259 -0.372256
2013-01-04 -2.394239  3.696449  0.981918  0.050980
2013-01-05 -4.100409  4.356750  3.431201  1.052321
2013-01-06 -4.107555  5.470822  3.407622  2.487983

In [129]:
df

                   A         B         C         D
2013-01-01 -0.674154  1.488528  1.258111 -0.783923
2013-01-02 -0.889458  0.381443  1.278126  0.924373
2013-01-03 -0.642209  0.639740 -0.501979 -0.512706
2013-01-04 -0.188418  1.186738 -1.052341  0.423237
2013-01-05 -1.706170  0.660301  2.449283  1.001341
2013-01-06 -0.007147  1.114072 -0.023579  1.435661

## Merge

### Concat

In [130]:
df = pd.DataFrame(np.random.randn(10, 4))
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  1.045794 -1.672366  0.661865  0.295681
1 -0.385340 -0.041111  0.748300  1.476371
2  0.171151 -2.387252 -0.067413 -0.049236
3  1.059095  0.284569 -0.208873  0.412971
4 -1.105174 -0.917721 -0.177814  0.749050
5 -0.589080 -2.152274 -1.207398  1.348009
6  3.067061 -1.242051  0.691819 -0.514827
7 -0.373240 -0.415519  0.487258 -1.393932
8  0.557683 -0.072189 -0.741748 -0.782679
9 -0.431997  0.811749  1.434540 -0.082522

### Join

In [134]:
#similiar to mapping
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [1, 2]})
print(left)
print(right)

   key  lval
0  foo     1
1  foo     2
   key  rval
0  foo     1
1  foo     2

In [135]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     1
1  foo     1     2
2  foo     2     1
3  foo     2     2

In [136]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
print(left)
print(right)

   key  lval
0  foo     1
1  bar     2
   key  rval
0  foo     4
1  bar     5

In [137]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append

In [139]:
df.append(df.iloc[3], ignore_index=True)

           0         1         2         3
0   1.045794 -1.672366  0.661865  0.295681
1  -0.385340 -0.041111  0.748300  1.476371
2   0.171151 -2.387252 -0.067413 -0.049236
3   1.059095  0.284569 -0.208873  0.412971
4  -1.105174 -0.917721 -0.177814  0.749050
5  -0.589080 -2.152274 -1.207398  1.348009
6   3.067061 -1.242051  0.691819 -0.514827
7  -0.373240 -0.415519  0.487258 -1.393932
8   0.557683 -0.072189 -0.741748 -0.782679
9  -0.431997  0.811749  1.434540 -0.082522
10  1.059095  0.284569 -0.208873  0.412971

## Grouping
By “group by” we are referring to a process involving one or more of the following steps

Splitting the data into groups based on some criteria

Applying a function to each group independently

Combining the results into a data structure

In [4]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                       'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [5]:
type(df)

pandas.core.frame.DataFrame

In [141]:
df.groupby('A').sum()

            C         D
A
bar -2.874926  0.346198
foo -1.911735 -1.382388

In [145]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.199595  2.541559
    three -0.327386 -2.169949
    two    0.600169  1.105223
foo one   -1.644826 -1.309670
    three  0.771136 -1.217983
    two   -1.907915 -0.383215

## Reshaping

### stack

In [156]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))

In [157]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [154]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [155]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [152]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [153]:
df

                     A         B
first second
bar   one     1.508495 -0.068362
      two    -2.153663  0.684353
baz   one     1.836456 -1.423460
      two    -0.303417  0.463637
foo   one     2.063110  1.254499
      two     2.778319 -1.134777
qux   one    -0.329000  0.238331
      two    -0.845415  0.876512

In [158]:
#The stack() method “compresses” a level in the DataFrame’s columns.
df.stack()

first  second
bar    one     A    1.508495
               B   -0.068362
       two     A   -2.153663
               B    0.684353
baz    one     A    1.836456
               B   -1.423460
       two     A   -0.303417
               B    0.463637
foo    one     A    2.063110
               B    1.254499
       two     A    2.778319
               B   -1.134777
qux    one     A   -0.329000
               B    0.238331
       two     A   -0.845415
               B    0.876512
dtype: float64

In [161]:
#default unstack the last level
df.stack().unstack()

                     A         B
first second
bar   one     1.508495 -0.068362
      two    -2.153663  0.684353
baz   one     1.836456 -1.423460
      two    -0.303417  0.463637
foo   one     2.063110  1.254499
      two     2.778319 -1.134777
qux   one    -0.329000  0.238331
      two    -0.845415  0.876512

In [162]:
df.stack().unstack(1)

second        one       two
first
bar   A  1.508495 -2.153663
      B -0.068362  0.684353
baz   A  1.836456 -0.303417
      B -1.423460  0.463637
foo   A  2.063110  2.778319
      B  1.254499 -1.134777
qux   A -0.329000 -0.845415
      B  0.238331  0.876512

### Pivot Tables

In [163]:
 df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                     'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D' : np.random.randn(12),
                       'E' : np.random.randn(12)})

In [164]:
df

        A  B    C         D         E
0     one  A  foo -1.110870  0.528979
1     one  B  foo  2.916324  1.317491
2     two  C  foo -0.223952 -2.003177
3   three  A  bar  0.890267  0.760008
4     one  B  bar  1.366268 -0.992721
5     one  C  bar  0.967855  1.142046
6     two  A  foo  0.387471  0.880772
7   three  B  foo -0.191575 -1.696638
8     one  C  foo -0.339523 -1.640223
9     one  A  bar -1.828638  0.108414
10    two  B  bar  1.191250  1.343462
11  three  C  bar -0.006005 -0.612050

In [165]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -1.828638 -1.110870
      B  1.366268  2.916324
      C  0.967855 -0.339523
three A  0.890267       NaN
      B       NaN -0.191575
      C -0.006005       NaN
two   A       NaN  0.387471
      B  1.191250       NaN
      C       NaN -0.223952

## Categoricals

like factor in R

In [166]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [168]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [170]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [172]:
#create more categories
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [173]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [174]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [176]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64